import { type MerchantPaymInfoItem } from "../../../../common/interfaces";

/**
 * Дані для збереження картки (токенізації).
 */
export interface InvoiceSaveCardData {
    /**
     * Ознака збереження картки після оплати.
     * Обов’язкове поле.
     */
    saveCard: boolean;

    /**
     * Ідентифікатор гаманця користувача.
     * Необов’язкове поле.
     */
    walletId?: string;
}

/**
 * Тип, що представляє запит на створення інвойсу (рахунку).
 */
export interface CreateInvoiceRequest {
    /**
     * Сума оплати у мінімальних одиницях (наприклад, копійки для гривні).
     * Обов’язкове поле.
     */
    amount: number;

    /**
     * Код валюти за стандартом ISO 4217. За замовчуванням — 980 (гривня).
     * Необов’язкове поле.
     */
    ccy?: number;

    /**
     * Адреса для повернення (GET) після завершення оплати (успішно або з помилкою).
     * Необов’язкове поле.
     */
    redirectUrl?: string;

    /**
     * Адреса для зворотного виклику (webhook, POST), на яку надсилатиметься інформація про зміну статусу рахунку.
     * Необов’язкове поле.
     */
    webHookUrl?: string;

    /**
     * Строк дії рахунку в секундах. За замовчуванням — 24 години.
     * Необов’язкове поле.
     */
    validity?: number;

    /**
     * Тип операції.
     * 'debit' — списання,
     * 'hold' — холд коштів на 9 днів.
     * Необов’язкове поле.
     */
    paymentType?: "debit" | "hold";

    /**
     * Ідентифікатор QR-каси для встановлення суми на існуючих касах.
     * Необов’язкове поле.
     */
    qrId?: string;

    /**
     * Код терміналу субмерчанта. Доступний лише окремим мерчантам.
     * Необов’язкове поле.
     */
    code?: string;

    /**
     * Відсоток комісії, який агент встановлює для себе.
     * Необов’язкове поле.
     */
    agentFeePercent?: number;

    /**
     * Ідентифікатор працівника, який може отримати чайові.
     * Необов’язкове поле.
     */
    tipsEmployeeId?: string;

    /**
     * Тип відображення платіжної форми. Якщо не вказано — буде звичайне посилання.
     * Необов’язкове поле.
     */
    displayType?: "iframe";

    /**
     * Інформація про платіж, яка може використовуватись для фіскалізації (checkbox).
     * Необов’язкове поле.
     */
    merchantPaymInfo?: MerchantPaymInfoItem;

    /**
     * Дані для збереження (токенізації) картки після оплати.
     * Необов’язкове поле.
     */
    saveCardData?: InvoiceSaveCardData;
}
