/**
 * Тип знижки або надбавки.
 */
export interface Discount {
    /**
     * Тип:
     * - DISCOUNT — знижка
     * - EXTRA_CHARGE — надбавка
     * Обов’язкове поле.
     */
    type: "DISCOUNT" | "EXTRA_CHARGE";

    /**
     * Режим:
     * - PERCENT — у відсотках
     * - VALUE — фіксоване значення
     * Обов’язкове поле.
     */
    mode: "PERCENT" | "VALUE";

    /**
     * Значення знижки або надбавки.
     * Обов’язкове поле.
     */
    value: number;
}

/**
 * Позиція в кошику замовлення.
 */
export interface BasketItem {
    /**
     * Назва товару або послуги.
     * Обов’язкове поле.
     */
    name: string;

    /**
     * Кількість одиниць товару.
     * Обов’язкове поле.
     */
    qty: number;

    /**
     * Ціна за одиницю товару у мінімальних одиницях валюти (наприклад, копійки для гривні).
     * Обов’язкове поле.
     */
    sum: number;

    /**
     * Загальна сума за позицію (sum * qty).
     * Якщо не передано — може бути обрахована на бекенді.
     * Необов’язкове поле.
     */
    total?: number;

    /**
     * Посилання на зображення товару.
     * Необов’язкове поле.
     */
    icon?: string;

    /**
     * Назва одиниці виміру товару (наприклад: шт, кг, м).
     * Необов’язкове поле.
     */
    unit?: string;

    /**
     * Код товару (обов’язкове поле для фіскалізації).
     * Обов’язкове поле.
     */
    code: string;

    /**
     * Значення штрих-коду, яке може бути використане при фіскалізації.
     * Необов’язкове поле.
     */
    barcode?: string;

    /**
     * Текст, що буде виводитись перед назвою товару (наприклад, категорія).
     * Необов’язкове поле.
     */
    header?: string;

    /**
     * Текст, що буде виводитись після назви товару.
     * Необов’язкове поле.
     */
    footer?: string;

    /**
     * Масив податкових ставок, вибраних під час налаштування каси в Checkbox.
     * У випадку з ПРРО monopay ставки поки що не використовуються.
     * Необов’язкове поле.
     */
    tax?: number[];

    /**
     * Код УКТ ЗЕД для товару.
     * Необов’язкове поле.
     */
    uktzed?: string;

    /**
     * Знижки або надбавки, що застосовуються саме до цієї позиції.
     * Необов’язкове поле.
     */
    discounts?: Discount[];
}

/**
 * Інформація про платіж для клієнта та фіскалізації.
 */
export interface MerchantPaymInfoItem {
    /**
     * Номер замовлення або чека, який задає продавець.
     * Необов’язкове поле.
     */
    reference?: string;

    /**
     * Призначення платежу, що буде відображене у чеку.
     * Максимальна довжина — 280 символів.
     * Необов’язкове поле.
     */
    destination?: string;

    /**
     * Службове поле для додаткової інформації.
     * Не відображається клієнту. Максимум 280 символів.
     * Необов’язкове поле.
     */
    comment?: string;

    /**
     * Масив email-адрес клієнтів, на які буде відправлено фіскальний чек.
     * Працює лише за наявності зв’язки з checkbox.
     * Необов’язкове поле.
     */
    customerEmails?: string[];

    /**
     * Знижки або надбавки, які застосовуються до всього кошика.
     * Враховуються під час фіскалізації (checkbox).
     * Необов’язкове поле.
     */
    discounts?: Discount[];

    /**
     * Склад замовлення — деталі позицій у кошику.
     * Обов’язкове поле при активній зв’язці з ПРРО.
     */
    basketOrder?: BasketItem[];
}

/**
 * Дані про токенізовану картку у гаманці користувача.
 */
export interface WalletData {
    /**
     * Токен картки.
     */
    cardToken: string;
    /**
     * Ідентифікатор гаманця покупця.
     */
    walletId: string;
    /**
     * Статус токенізації картки.
     */
    status: "new" | "created" | "failed";
}

/**
 * Інформація про виплату чайових співробітнику.
 */
export interface TipsInfo {
    /**
     * Ідентифікатор співробітника, якому можна виплатити чайові.
     */
    employeeId: string;
    /**
     * Сума успішно сплачених чайових у мінімальних одиницях валюти.
     */
    amount: number;
}

/**
 * Інформація про оплату, включаючи дані щодо токенізації картки та чайових.
 */
export interface InvoiceCancelItem {
    status: "processing" | "success" | "failure" | "reversed";
    walletData: WalletData;
    tipsInfo?: TipsInfo;
}
