import { BasketItem } from "./common.interface";

/**
 * Тіло запиту на скасування інвойсу.
 */
export interface RefundRequest {
    /**
     * Унікальний ідентифікатор інвойсу, який необхідно скасувати.
     */
    invoiceId: string;

    /**
     * Унікальний зовнішній ідентифікатор скасування, визначений продавцем (необов’язковий).
     */
    extRef?: string;

    /**
     * Сума повернення у мінімальних одиницях валюти (необов’язкова, використовується при частковому поверненні).
     */
    amount?: number;

    /**
     * Список товарів, які скасовуються, обов'язковий при активованій фіскалізації.
     */
    items?: BasketItem[];
}

/**
 * Відповідь на запит про скасування інвойсу.
 */
export interface Refund {
    /**
     * Статус операції скасування.
     */
    status: string | null;

    /**
     * Дата створення операції скасування.
     */
    createdDate: string | null;

    /**
     * Дата останньої модифікації операції.
     */
    modifiedDate: string | null;
}
