/**
 * Об'єкт товару для скасування інвойсу.
 * Використовується у випадку, якщо активовано фіскалізацію або потрібен чек.
 */
export interface InvoiceCancelItem {
    /**
     * Назва товару.
     */
    name: string;
    /**
     * Кількість товару.
     */
    qty: number;
    /**
     * Сума у мінімальних одиницях валюти за одиницю товару.
     */
    sum: number;
    /**
     * Код товару (обов'язковий для фіскалізації).
     */
    code: string;
    /**
     * Штрих-код товару (необов’язковий, може бути потрібний для фіскалізації).
     */
    barcode?: string;
    /**
     * Текст, що відображається перед назвою товару (необов’язковий).
     */
    header?: string;
    /**
     * Текст, що відображається після товару (необов’язковий).
     */
    footer?: string;
    /**
     * Масив податкових ставок (не використовується при ПРРО monopay).
     */
    tax?: number[] | null;
    /**
     * УКТ ЗЕД код товару (необов’язковий, але може бути потрібний для фіскалізації).
     */
    uktzed?: string;
}
/**
 * Тіло запиту на скасування інвойсу.
 */
export interface InvoiceCancelRequest {
    /**
     * Унікальний ідентифікатор інвойсу, який необхідно скасувати.
     */
    invoiceId: string;
    /**
     * Унікальний зовнішній ідентифікатор скасування, визначений продавцем (необов’язковий).
     */
    extRef?: string;
    /**
     * Сума повернення у мінімальних одиницях валюти (необов’язкова, використовується при частковому поверненні).
     */
    amount?: number;
    /**
     * Список товарів, які скасовуються, обов'язковий при активованій фіскалізації.
     */
    items?: InvoiceCancelItem[];
}
/**
 * Відповідь на запит про скасування інвойсу.
 */
export interface InvoiceCancel {
    /**
     * Статус операції скасування.
     */
    status: string | null;
    /**
     * Дата створення операції скасування.
     */
    createdDate: string | null;
    /**
     * Дата останньої модифікації операції.
     */
    modifiedDate: string | null;
}
