import type { BasketItem } from "../../../../common/interfaces";
/**
 * Тіло запиту на скасування інвойсу.
 */
export interface CreateCancelRequest {
    /**
     * Унікальний ідентифікатор інвойсу, який необхідно скасувати.
     */
    invoiceId: string;
    /**
     * Унікальний зовнішній ідентифікатор запиту на скасування, визначений продавцем (необов’язковий).
     */
    extRef?: string;
    /**
     * Сума повернення у мінімальних одиницях валюти (необов’язкова, використовується при частковому поверненні).
     */
    amount?: number;
    /**
     * Список товарів, які необхідно скасувати, обов'язковий при активованій фіскалізації.
     */
    items?: BasketItem[];
}
