/**
 * Дані для збереження картки (токенізації).
 */
export interface InvoiceSaveCardData {
    /**
     * Ознака збереження картки після оплати.
     * Обов’язкове поле.
     */
    saveCard: boolean;
    /**
     * Ідентифікатор гаманця користувача.
     * Необов’язкове поле.
     */
    walletId?: string;
}
/**
 * Тип знижки або надбавки.
 */
export interface InvoiceDiscount {
    /**
     * Тип:
     * - DISCOUNT — знижка
     * - EXTRA_CHARGE — надбавка
     * Обов’язкове поле.
     */
    type: "DISCOUNT" | "EXTRA_CHARGE";
    /**
     * Режим:
     * - PERCENT — у відсотках
     * - VALUE — фіксоване значення
     * Обов’язкове поле.
     */
    mode: "PERCENT" | "VALUE";
    /**
     * Значення знижки або надбавки.
     * Обов’язкове поле.
     */
    value: number;
}
/**
 * Позиція в кошику замовлення.
 */
export interface InvoiceBasketItem {
    /**
     * Назва товару або послуги.
     * Обов’язкове поле.
     */
    name: string;
    /**
     * Кількість одиниць товару.
     * Обов’язкове поле.
     */
    qty: number;
    /**
     * Ціна за одиницю товару у мінімальних одиницях валюти (наприклад, копійки для гривні).
     * Обов’язкове поле.
     */
    sum: number;
    /**
     * Загальна сума за позицію (sum * qty).
     * Якщо не передано — може бути обрахована на бекенді.
     * Необов’язкове поле.
     */
    total?: number;
    /**
     * Посилання на зображення товару.
     * Необов’язкове поле.
     */
    icon?: string;
    /**
     * Назва одиниці виміру товару (наприклад: шт, кг, м).
     * Необов’язкове поле.
     */
    unit?: string;
    /**
     * Код товару (обов’язкове поле для фіскалізації).
     * Обов’язкове поле.
     */
    code: string;
    /**
     * Значення штрих-коду, яке може бути використане при фіскалізації.
     * Необов’язкове поле.
     */
    barcode?: string;
    /**
     * Текст, що буде виводитись перед назвою товару (наприклад, категорія).
     * Необов’язкове поле.
     */
    header?: string;
    /**
     * Текст, що буде виводитись після назви товару.
     * Необов’язкове поле.
     */
    footer?: string;
    /**
     * Масив податкових ставок, вибраних під час налаштування каси в Checkbox.
     * У випадку з ПРРО monopay ставки поки що не використовуються.
     * Необов’язкове поле.
     */
    tax?: number[];
    /**
     * Код УКТ ЗЕД для товару.
     * Необов’язкове поле.
     */
    uktzed?: string;
    /**
     * Знижки або надбавки, що застосовуються саме до цієї позиції.
     * Необов’язкове поле.
     */
    discounts?: InvoiceDiscount[];
}
/**
 * Інформація про платіж для клієнта та фіскалізації.
 */
export interface InvoiceMerchantPaymInfoItem {
    /**
     * Номер замовлення або чека, який задає продавець.
     * Необов’язкове поле.
     */
    reference?: string;
    /**
     * Призначення платежу, що буде відображене у чеку.
     * Максимальна довжина — 280 символів.
     * Необов’язкове поле.
     */
    destination?: string;
    /**
     * Службове поле для додаткової інформації.
     * Не відображається клієнту. Максимум 280 символів.
     * Необов’язкове поле.
     */
    comment?: string;
    /**
     * Масив email-адрес клієнтів, на які буде відправлено фіскальний чек.
     * Працює лише за наявності зв’язки з checkbox.
     * Необов’язкове поле.
     */
    customerEmails?: string[];
    /**
     * Знижки або надбавки, які застосовуються до всього кошика.
     * Враховуються під час фіскалізації (checkbox).
     * Необов’язкове поле.
     */
    discounts?: InvoiceDiscount[];
    /**
     * Склад замовлення — деталі позицій у кошику.
     * Обов’язкове поле при активній зв’язці з ПРРО.
     */
    basketOrder?: InvoiceBasketItem[];
}
/**
 * Тип, що представляє запит на створення інвойсу (рахунку).
 */
export interface InvoiceCreateRequest {
    /**
     * Сума оплати у мінімальних одиницях (наприклад, копійки для гривні).
     * Обов’язкове поле.
     */
    amount: number;
    /**
     * Код валюти за стандартом ISO 4217. За замовчуванням — 980 (гривня).
     * Необов’язкове поле.
     */
    ccy?: number;
    /**
     * Адреса для повернення (GET) після завершення оплати (успішно або з помилкою).
     * Необов’язкове поле.
     */
    redirectUrl?: string;
    /**
     * Адреса для зворотного виклику (webhook, POST), на яку надсилатиметься інформація про зміну статусу рахунку.
     * Необов’язкове поле.
     */
    webHookUrl?: string;
    /**
     * Строк дії рахунку в секундах. За замовчуванням — 24 години.
     * Необов’язкове поле.
     */
    validity?: number;
    /**
     * Тип операції.
     * 'debit' — списання,
     * 'hold' — холд коштів на 9 днів.
     * Необов’язкове поле.
     */
    paymentType?: "debit" | "hold";
    /**
     * Ідентифікатор QR-каси для встановлення суми на існуючих касах.
     * Необов’язкове поле.
     */
    qrId?: string;
    /**
     * Код терміналу субмерчанта. Доступний лише окремим мерчантам.
     * Необов’язкове поле.
     */
    code?: string;
    /**
     * Відсоток комісії, який агент встановлює для себе.
     * Необов’язкове поле.
     */
    agentFeePercent?: number;
    /**
     * Ідентифікатор працівника, який може отримати чайові.
     * Необов’язкове поле.
     */
    tipsEmployeeId?: string;
    /**
     * Тип відображення платіжної форми. Якщо не вказано — буде звичайне посилання.
     * Необов’язкове поле.
     */
    displayType?: "iframe";
    /**
     * Інформація про платіж, яка може використовуватись для фіскалізації (checkbox).
     * Необов’язкове поле.
     */
    merchantPaymInfo?: InvoiceMerchantPaymInfoItem;
    /**
     * Дані для збереження (токенізації) картки після оплати.
     * Необов’язкове поле.
     */
    saveCardData?: InvoiceSaveCardData;
}
